################################################################################
### 设置窗口标题

# package require Tk
# 
# wm title . "My Application"

################################################################################
### 设置窗口大小和位置

# package require Tk
# 
# wm geometry . 300x300+100+50

################################################################################
### 最小化和恢复窗口

# package require Tk
# 
# wm iconify .
# after 2000 {
# 	wm deiconify .
# }

################################################################################
### 处理窗口关闭事件

# package require Tk
# 
# wm protocol . WM_DELETE_WINDOW {
# 	puts "Window is closing..."
# 	exit
# }

################################################################################
### 设置窗口为不可调整大小

# package require Tk
# 
# wm resizable . 0 0 

################################################################################
### 设置窗口置顶 

# package require Tk
# 
# wm attributes . -topmost 1

################################################################################
### 隐藏窗口

# package require Tk
# 
# wm withdraw .
# after 2000 {
# 	wm deiconify .
# }

# ################################################################################
### 设置窗口为全屏

package require Tk

wm attributes . -fullscreen 1

